Revit 2026 API

# BuiltInFailuresMatchlineFailures Class

---

Failures about Matchline.

SystemObject Autodesk.Revit.DBBuiltInFailuresMatchlineFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class MatchlineFailures
```
```vb
Public NotInheritable Class MatchlineFailures
```
```cpp
public ref class MatchlineFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type MatchlineFailures = class end
```

The BuiltInFailuresMatchlineFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreationFailed | Matchline top extent should be higher than its bottom. |

#### Reference

Autodesk.Revit.DB Namespace